var stationMap = [
    {
        name: '机场南',
        value: [1126,28],   //3号线
    },{
        name: '高增',
        value:[1126,62],
    },{
        name: '人和',
        value: [1126,96],
    },{
        name: '龙归',
        value: [1127,130],
    },{
       name: '嘉禾望岗',
       value: [1126,161]
    },{
       name: '白云大道北',
       value: [1147,184],
    },{
       name: '永泰',
       value: [1174,210],
    },{
       name: '同和',
       value: [1200,236],
    },{
       name: '京溪南方医院',
       value: [1227,262],
    },{
       name: '梅花园',
       value: [1253,288],
    },{
       name: '燕塘',
       value: [1266,320],
    },{
       name: '广州东站',
       value: [1266,390],
    },{
       name: '林和西',
       value: [1266,434],
    },{
       name: '体育西路',
       value: [1266,512],
    },{

        //
       name: '珠江新城',
       value: [1267,578],
    },{
       name: '广州塔',
       value: [1266,670],
    },{
       name: '客村',
       value: [1266,697],
    },{
       name: '大塘',
       value: [1266,738],
    },{
       name: '沥滘',
       value: [1267,786],
    },{
       name: '厦滘',
       value: [1266,834],
    },{
       name: '大石',
       value: [1265,882],
    },{
        name:'汉溪长隆',
        value:[1266,928],
    },{
       name: '市桥',
       value: [1298,986],
    },{
       name: '番禺广场',
       value: [1332,1019],
    },{
       name: '黄边',    //2号线
       value: [1105,183],
    },{
       name: '江夏',
       value: [1078,209],
    },{
       name: '萧岗',
       value: [1052,236],
    },{
       name: '白云文化广场',
       value: [1027,261],
    },{
       name: '白云公园',
       value: [1000,287],
    },{
       name: '飞翔公园',
       value: [988,327],
    },{
       name: '三元里',
       value: [988,363],
    },{
       name: '广州火车站',
       value: [989,394],
    },{
       name: '越秀公园',
       value: [988,431],
    },{
       name: '纪念堂',
       value: [989,471],
    },{
       name: '公园前',
       value: [988,512],
    },{
       name: '海珠广场',
       value: [988,583],
    },{
       name: '市二宫',
       value: [988,622],
    },{
       name: '江南西',
       value: [989,655],
    },{
       name: '昌岗',
       value: [989,696],
    },{
       name: '江泰路',
       value: [989,725],
    },{
       name: '东晓南',
       value: [988,764],
    },{
       name: '南洲',
       value: [989,804],
    },{
       name: '洛溪',
       value: [988,844],
    },{
       name: '南浦',
       value: [986,883],
    },{
       name: '会江',
       value: [988,925],
    },{
       name: '石壁',
       value: [992,965]
    },{
       name: '广州南站',
       value: [992,1001],
    },{
       name: '滘口',//五号线红色
       value: [665,606],
    },{
       name: '坦尾',
       value: [734,537],
    },{
       name: '中山八',
       value: [783,489],
    },{
       name: '西场',
       value: [820,451],
    },{
       name: '西村',
       value: [856,416],
    },{
           name: '小北',
           value: [1038,394],
        },{
           name: '淘金',
           value: [1087,395],
        },{
           name: '区庄',
           value: [1140,395],
        },{
           name: '动物园',
           value: [1187,450],
        },{
           name: '杨箕',
           value: [1186,513],
        },{
           name: '五羊邨',
           value: [1207,579],//五号线
        },{
           name: '珠江新城',
           value: [1266,579],
        },{
           name: '猎德',
           value: [1356,579],
        },{
           name: '潭村',
           value: [1394,578],
        },{
           name: '员村',
           value: [1431,579],
        },{
           name: '科韵路',
           value: [1469,579],
        },{
           name: '车陂南',
           value: [1508,580],
        },{
           name: '东圃',
           value: [1569,579],
        },{
           name: '三溪',
           value: [1613,579],
        },{
           name: '鱼珠',
           value: [1658,579],
        },{
           name: '大沙地',
           value: [1705,579],
        },{
           name: '大沙东',
           value: [1747,579],
        },{
           name: '文冲',
           value: [1791,579],
        },{
            name: '香雪',//六号线右开
            value: [1823,269],
        },{
           name: '萝岗',
           value: [1787,269],
        },{
           name: '苏元',
           value: [1757,269],
        },{
           name: '暹岗',
           value: [1722,269],
        },{
           name: '金峰',
           value: [1690,270],
        },{
           name: '黄陂',
           value: [1658,269],
        },{
           name: '高塘石',
           value: [1624,269],
        },{
           name: '柯木塱',
           value: [1576,269],
        },{
           name: '龙洞',
           value: [1547,270],
        },{
           name: '植物园',
           value: [1515,270],
        },{
           name: '长湴',
           value: [1481,297],
        },{
           name: '天河客运站',
           value: [1449,318],
        },{
           name: '天平架',
           value: [1216,318],
        },{
           name: '沙河',
           value: [1169,318],
        },{
           name: '沙河顶',
           value: [1139,344],
        },{
           name: '黄花岗',
           value: [1139,368],
        },{
           name: '东山口',
           value: [1139,515],
        },{
           name: '东湖',
           value: [1118,583],
        },{
           name: '团一大广场',
           value: [1075,582],
        },{
           name: '北京路',
           value: [1033,583],
        },{
           name: '一德路',
           value: [926,582],
        },{
           name: '文化公园',
           value: [885,583],
        },{
           name: '黄沙',
           value: [837,582],
        },{
           name: '如意坊',
           value: [766,570],
        },{
           name: '河沙',
           value: [677,436],
        },{
           name: '沙贝',
           value: [677,389],
        },{
           name: '横沙',
           value: [677,343],
        },{
           name: '浔峰岗',
           value: [677,297],
        },{
           name: '五山',//三号线剩下一部分
           value: [1447,394],
        },{
           name: '华师',
           value: [1439,473],
        },{
           name: '岗顶',
           value: [1411,499],
        },{
           name: '石牌桥',
           value: [1363,516],
        },{
           name: '体育中心',//一号线
           value: [1367,419],
        },{
           name: '烈士陵园',
           value: [1090,513],
        },{
           name: '农讲所',
           value: [1039,513],
        },{
           name: '西门口',
           value: [942,513],
        },{
           name: '陈家祠',
           value: [881,513],
        },{
           name: '长寿路',
           value: [839,543],
        },{
           name: '芳村',
           value: [839,624],
        },{
           name: '花地湾',
           value: [839,666],
        },{
           name: '坑口',
           value: [840,708],
        },{
           name: '西朗',
           value: [840,749],
        },{
           name: '万胜围',//8号线
           value: [1506,696],
        },{
           name: '琶洲',
           value: [1459,696],
        },{
           name: '新港东',
           value: [1410,696],
        },{
           name: '磨碟沙',
           value: [1363,696],
        },{
           name: '赤岗',
           value: [1315,696],
        },{
           name: '鹭江',
           value: [1197,697],
        },{
           name: '中大',
           value: [1127,697],
        },{
           name: '晓港',
           value: [1058,697],
        },{
           name: '宝岗大道',
           value: [939,689],
        },{
           name: '沙园',
           value: [915,665],
        },{
           name: '凤凰新村',
           value: [891,643],
        },{
           name: '大学城南',//7号线
           value: [1506,789],
        },{
           name: '板桥',
           value: [1455,894],
        },{
           name: '员岗',
           value: [1394,929],
        },{
           name: '南村万博',
           value: [1337,929],
        },{
           name: '汉溪长隆',
           value: [1267,929],
        },{
           name: '钟村',
           value: [1162,928],
        },{
           name: '谢村',
           value: [1076,928],
        },{
           name: '石壁',
           value: [994,965],
        },{
           name: '燕岗',//GF线
           value: [919,694],
        },{
           name: '沙涌',
           value: [895,699],
        },{
           name: '鹤洞',
           value: [879,728],
        },{
           name: '菊树',
           value: [798,751],
        },{
           name: '龙溪',
           value: [746,752],
        },{
           name: '金融高新区',
           value: [706,775],
        },{
           name: '千灯湖',
           value: [707,809],
        },{
           name: '虫雷岗',
           value: [707,842],
        },{
           name: '南桂路',
           value: [685,869],
        },{
           name: '桂城',
           value: [639,869],
        },{
           name: '朝安',
           value: [596,869],
        },{
           name: '普君北路',
           value: [552,870],
        },{
           name: '祖庙',
           value: [520,898],
        },{
           name: '同济路',
           value: [518,929],
        },{
           name: '季华园',
           value: [519,959],
        },{
           name: '魁奇路',
           value: [520,991],
        },{
           name: '澜石',
           value: [519,1023],
        },{
           name: '世纪莲',
           value: [567,1050],
        },{
           name: '东平',
           value: [612,1050],
        },{
           name: '新城东',
           value: [655,1050],
        },{
           name: '体育中心南',
           value: [1299,460],//线APM
        },{
           name: '天河南',
           value: [1299,489],
        },{
           name: '黄埔大道',
           value: [1300,532],
        },{
           name: '妇儿中心',
           value: [1299,555],
        },{
           name: '花城大道',
           value: [1300,594],
        },{
           name: '大剧院',
           value: [1300,615],
        },{
           name: '海心沙',
           value: [1300,637],
        },{
           name: '黄村',
           value: [1588,498],//四号线
        },{
           name: '车陂',
           value: [1547,537],
        },{
           name: '官洲',
           value: [1508,720],
        },{
           name: '大学城北',
           value: [1507,754],
        },{
           name: '新造',
           value: [1507,820],
        },{
           name: '官桥',
           value: [1507,852],
        },{
           name: '石碁',
           value: [1507,886],
        },{
           name: '海傍',
           value: [1507,919],
        },{
           name: '低涌',
           value: [1507,952],
        },{
           name: '东涌',
           value: [1507,987],
        },{
           name: '庆盛',
           value: [1534,1014],
        },{
           name: '黄阁汽车城',
           value: [1581,1014],
        },{
           name: '黄阁',
           value: [1629,1014],
        },{
           name: '蕉门',
           value: [1678,1014],
        },{
           name: '金洲',
           value: [1726,1014],
        }
]